string[] предмет = new string[12];
предмет[0] = "Биология";
предмет[1] = "География";
предмет[2] = "Ин.язык";
предмет[3] = "Информатика";
предмет[4] = "История";
предмет[5] = "Литература";
предмет[6] = "Математика";
предмет[7] = "Обществознание";
предмет[8] = "Русский язык";
предмет[9] = "Физ. культура";
предмет[10] = "Физика";
предмет[11] = "Химия";
double[] оценка = new double[12];
double средний_балл = 0.0;
for (int i = 0; i < 12; i++)
{
    Console.WriteLine("Оценка по предмету " + предмет[i] + " - ");
    оценка[i] = Convert.ToDouble(Console.ReadLine());
}
for (int i = 0; i < 12; i++)
{
    средний_балл = средний_балл + оценка[i];
}
средний_балл = средний_балл / 12;
string балл = Convert.ToString(средний_балл);
Console.WriteLine("Ваш средний балл = " + балл);
Console.ReadLine();